pg-core/app/controllers/api/v1/goals_step_controller.rb

SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "goals_steps" ("title", "description", "time_to_reach_in_days", "time_to_reach_in_hours", "time_to_reach_in_minutes", "goals_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
      def create # rubocop:disable Metrics/MethodLength
        @goals = Goals.find(params[:goals_id])
        @goal_step =  GoalsStep.new(allowed_params_create)
        @goal_step.goals_id = @goals[:id]

        if @goal_step.save

SELECT "goals_steps".* FROM "goals_steps" WHERE "goals_steps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "goals_steps" SET "updated_at" = $1, "completed" = $2, "completed_at" = $3 WHERE "goals_steps"."id" = $4  [["updated_at", "2023-07-01 17:35:03.377026"], ["completed", true], ["completed_at", "2023-07-01 17:35:03.341000"], ["id", 48]]
UPDATE "goals_steps" SET "updated_at" = $1, "completed" = $2, "completed_at" = $3 WHERE "goals_steps"."id" = $4  [["updated_at", "2023-07-08 14:06:54.582456"], ["completed", true], ["completed_at", "2023-07-08 14:06:54.391000"], ["id", 47]]
---
      def update
        @goal_step = GoalsStep.find(params[:id])
        if params[:completed]
          if @goal_step.started
            @goal_step.update(allowed_params_update)
          else
            updated_params = allowed_params_update.merge(started: true, start_at: Time.now)
            @goal_step.update(updated_params)
          end
          elsif @goal_step.update(allowed_params_update)

SELECT COUNT(*) FROM "goals_steps"
SELECT "goals_steps".* FROM "goals_steps" ORDER BY created_at desc LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
      def index
        @goals_steps = GoalsStep.sorted(params[:sort], params[:dir])
                     .page(current_page)
                     .per(per_page)

SELECT "goals_steps".* FROM "goals_steps" WHERE "goals_steps"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "goals_steps" WHERE "goals_steps"."id" = $1  [["id", 25]]
---
      def delete
        @goal_step = GoalsStep.find(params[:id])
        if @goal_step.destroy