pg-core/app/controllers/api/v1/goals_list_controller.rb

      def create # rubocop:disable Metrics/MethodLength
        @goals_list = GoalsList.new(allowed_params_create)
        @goals_list.user_id = current_api_user[:id]

        if @goals_list.save
---
INSERT INTO "goals_lists" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Minha meta "], ["description", "Minha descrição"], ["user_id", 30], ["created_at", "2023-06-25 15:12:23.398305"], ["updated_at", "2023-06-25 15:12:23.398305"]]

      def show
        @goals_list = GoalsList.includes(:goals).find(params[:id])
        @ordered_goals = @goals_list.goals.order(start_at: :asc)
---
SELECT "goals".* FROM "goals" WHERE "goals"."goals_list_id" = $1  [["goals_list_id", 11]]
SELECT "goals_lists".* FROM "goals_lists" WHERE "goals_lists"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "goals".* FROM "goals" WHERE "goals"."goals_list_id" = $1 ORDER BY "goals"."start_at" ASC  [["goals_list_id", 20]]

      def index_public
        @goals_list = GoalsList.where(is_public: true)

        @goals_list = @goals_list.sorted(params[:sort], params[:dir])
                                 .page(current_page)
                                 .per(per_page)
---
SELECT COUNT(*) FROM "goals_lists" WHERE "goals_lists"."is_public" = $1  [["is_public", false]]
SELECT "goals_lists".* FROM "goals_lists" WHERE "goals_lists"."is_public" = $1 ORDER BY created_at desc LIMIT $2 OFFSET $3  [["is_public", false], ["LIMIT", 10], ["OFFSET", 0]]

      def index_private
        @goals_list = GoalsList.where(user_id: current_api_user[:id])
        @goals_list = @goals_list.sorted(params[:sort], params[:dir])
                                 .page(current_page)
                                 .per(per_page)
---
SELECT COUNT(*) FROM "goals_lists" WHERE "goals_lists"."user_id" = $1  [["user_id", 30]]
SELECT "goals_lists".* FROM "goals_lists" WHERE "goals_lists"."user_id" = $1 ORDER BY created_at desc LIMIT $2 OFFSET $3  [["user_id", 30], ["LIMIT", 10], ["OFFSET", 0]]

      def delete
        @goal_list = GoalsList.find(params[:id])
        if @goal_list.destroy
---
SELECT "goals_lists".* FROM "goals_lists" WHERE "goals_lists"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 25]]
DELETE FROM "goals_lists" WHERE "goals_lists"."id" = $1  [["id", 18]]