pg-core/app/controllers/api/v1/goals_controller.rb

      def create # rubocop:disable Metrics/MethodLength
        @goals_list = GoalsList.find(params[:goals_list_id])
        @goal =  Goals.new(allowed_params_create)
        @goal.goals_list_id = @goals_list[:id]

        if @goal.save
---
SELECT "goals_lists".* FROM "goals_lists" WHERE "goals_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "goals" ("title", "description", "time_to_reach_in_days", "time_to_reach_in_hours", "time_to_reach_in_minutes", "goals_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

      def show
        @goal = Goals.includes(:goals_step).find(params[:goals_id])
        @ordered_steps = @goal.goals_step.order(start_at: :asc)
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "goals_steps".* FROM "goals_steps" WHERE "goals_steps"."goals_id" = $1  [["goals_id", 12]]
SELECT "goals_steps".* FROM "goals_steps" WHERE "goals_steps"."goals_id" = $1 ORDER BY "goals_steps"."start_at" ASC  [["goals_id", 30]]

      def update
        @goal = Goals.find(params[:id])

        if params[:completed]
          @goals_steps = GoalsStep.where(goals_id: @goal.id)
          if @goal.started
            @goal.update(allowed_params_update)
          else
            updated_params = allowed_params_update.merge(started: true, start_at: Time.now)
            @goal.update(updated_params)
          end

          for @step in @goals_steps
            if @step.started
              @step.update(completed: true, completed_at: Time.now)
            else
              @step.update(
                completed: true,
                completed_at: Time.now,
                started: true,
                start_at: Time.now
              )
            end
          end

          render(json: { message: 'Goal and Goals Steps updated with success' }, status: 200)
        elsif @goal.update(allowed_params_update)
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "goals_steps".* FROM "goals_steps" WHERE "goals_steps"."goals_id" = $1  [["goals_id", 12]]
SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "goals" SET "updated_at" = $1, "started" = $2, "start_at" = $3, "completed" = $4, "completed_at" = $5 WHERE "goals"."id" = $6  [["updated_at", "2023-06-25 14:56:44.477796"], ["started", true], ["start_at", "2023-06-25 14:56:44.466114"], ["completed", true], ["completed_at", "2023-06-25 14:56:44.274000"], ["id", 10]]
UPDATE "goals_steps" SET "updated_at" = $1, "started" = $2, "start_at" = $3, "completed_at" = $4 WHERE "goals_steps"."id" = $5  [["updated_at", "2023-06-25 14:51:41.045849"], ["started", true], ["start_at", "2023-06-25 14:51:41.032634"], ["completed_at", "2023-06-25 14:51:41.032628"], ["id", 3]]
UPDATE "goals" SET "updated_at" = $1, "started" = $2, "start_at" = $3, "completed" = $4, "completed_at" = $5 WHERE "goals"."id" = $6  [["updated_at", "2023-06-25 14:49:24.873442"], ["started", false], ["start_at", "2023-06-03 19:38:47.587000"], ["completed", false], ["completed_at", "2023-06-03 19:38:47.587000"], ["id", 10]]
UPDATE "goals_steps" SET "updated_at" = $1, "completed_at" = $2 WHERE "goals_steps"."id" = $3  [["updated_at", "2023-06-25 14:56:44.495760"], ["completed_at", "2023-06-25 14:56:44.491880"], ["id", 1]]
UPDATE "goals" SET "updated_at" = $1, "started" = $2, "start_at" = $3 WHERE "goals"."id" = $4  [["updated_at", "2023-07-01 17:18:37.187428"], ["started", true], ["start_at", "2023-07-01 17:18:37.138000"], ["id", 30]]

      def delete
        @goal = Goals.find(params[:id])
        if @goal.destroy
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 24]]